FemDesign.Geometry.Proximity.LineLineProximity(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d)
Find the closest position between two infinite lines.
Closest point on line 1 will thus be at
var cp1 = p1 + (t1 * v1)
p1: Reference point on line 1
v1: Direction of line 1
p2: Reference point on line 2
v2: Direction of line 2
Returns: Parameters t1, t2, where the two lines are the closest to each other

FemDesign.Geometry.Proximity.LineLineProximity(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d)
Find the closest position between two infinite lines.
Closest point on line 1 will thus be at
var cp1 = start1 + (t1 * (end1 - start1))
start1: First reference point for infinite line 1
end1: Second reference point for infinite line 1
start2: First reference point for infinite line 2
end2: Second reference point for infinite line 2